cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# terminal tools
brew "git"
brew "ripgrep"
brew "fish"
brew "tldr"
brew "bat"
brew "fd"
brew "jq"
brew "terminal-notifier"
cask "font-meslo-nerd-font-mono"
cask "font-jetbrains-mono"
brew "grc"
brew "asdf"
tap "cjbassi/gotop"
brew "gotop" # better htop
brew "watch"
brew "tree"
brew "httpie"
brew "broot"

# dev app tools
cask "iterm2"
cask "emacs"
cask "docker"
cask "the-unarchiver"
cask "keepingyouawake"
cask "dbeaver-community"
cask "postman"

# asdf nodejs dependencies
brew "coreutils"
brew "gnupg"

# Erlang dependencies
brew "autoconf"
brew "wxmac"
brew "openssl"
#brew "fop"

# Apps
#cask "brave-browser"
cask "firefox"
cask "telegram"
cask "slack"
cask "evernote"
#cask "spotify"
#cask "deezer"
cask "visual-studio-code"
cask "zoomus"
cask "jetbrains-toolbox"
cask "flycut"
cask "kindle"
cask "transmission"
cask "skype"
cask "signal"
cask "mullvadvpn"
cask "vlc"
cask "notion"
cask "dash"

cask "balenaetcher"
