cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# tools
brew "git"
brew "emacs", args: ["with-cocoa", "with-gnutls"]
brew "ripgrep"
cask "iterm2"
brew "fish"
brew "tldr"
brew "bat"
brew "fd"
brew "jq"
brew "terminal-notifier"
cask "font-meslo-nerd-font-mono"
brew "grc"
brew "asdf"
# erlang dependencies
brew "autoconf"
brew "wxmac"
brew "openssl"
brew "fop"
# finish - erlang dependencies
brew "tree"
brew "httpie"
cask "docker"
cask "the-unarchiver"
cask "keepingyouawake"

# Apps
cask "brave-browser"
cask "telegram"
cask "slack"
cask "evernote"
cask "spotify"
cask "visual-studio-code"
cask "zoomus"
cask "jetbrains-toolbox"
cask "flycut"
