jethrokuan/z
oh-my-fish/theme-bobthefish
franciscolourenco/done
vrcca/take-fish
oh-my-fish/plugin-grc
Markcial/upto
edc/bass
gin0606/fish-git-aliases
